function dx = lab_ode(t, x)

    dx = zeros(4,1); % Инициализация вектора производных

    % Импорт глобальных переменных, необходимых для расчетов
    global m l mu u g

    % Уравнение движения для угла theta
    dx(1) = x(2);
    dx(2) = x(4)^2 * cos(x(1)) * sin(x(1)) ... 
            + m * g / l * sin(x(1)) ... 
            - mu / (m * l^2) * x(2) ... 
            + 1 / (m * l^2) * u(1); 

    % Уравнение движения для угла phi
    dx(3) = x(4); 
    dx(4) = -2 * x(2) * x(4) * cos(x(1)) / sin(x(1)) ... 
            - mu / (m * l^2 * (sin(x(1)))^2) * x(4) ... 
            + 1 / (m * l^2 * (sin(x(1)))^2) * u(2);
end
